tutorials/streetCanyonAirBrickRadiation/constant/air/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  (0 -10 0)
  (5 -10 0)
  (15 -10 0)
  (20 -10 0)
  (0 0 0)
  (5 0 0)
  (15 0 0)
  (20 0 0)
  (0 15 0)
  (5 15 0)
  (15 15 0)
  (20 15 0)
  (0 -10 0.01)
  (5 -10 0.01)
  (15 -10 0.01)
  (20 -10 0.01)
  (0 0 0.01)
  (5 0 0.01)
  (15 0 0.01)
  (20 0 0.01)
  (0 15 0.01)
  (5 15 0.01)
  (15 15 0.01)
  (20 15 0.01)
);
 
blocks
(
  hex (1 2 6 5 13 14 18 17) (40 40 1) simpleGrading (-6.56223352846947 -6.56223352846947 1)
  hex (4 5 9 8 16 17 21 20) (30 60 1) simpleGrading (0.286735855193167 6.66212446928844 1)
  hex (5 6 10 9 17 18 22 21) (40 60 1) simpleGrading (-6.56223352846947 6.66212446928844 1)
  hex (6 7 11 10 18 19 23 22) (30 60 1) simpleGrading (3.48753036134947 6.66212446928844 1)
);
 
edges
(
);
 
patches
(
  patch inlet
  (
      (4 16 20 8)
  )
  patch outlet
  (
      (7 19 23 11)
  )
  symmetryPlane top
  (
      (8 9 21 20)
      (9 10 22 21)
      (10 11 23 22)
  )
  wall ground
  (
      (1 2 14 13)
  )
  wall air_to_brick
  (
      (2 14 18 6)
  )  
  symmetryPlane sides
  (
      (1 2 6 5)
      (4 5 9 8)
      (5 6 10 9)
      (6 7 11 10)
      (13 14 18 17)
      (16 17 21 20)
      (17 18 22 21)
      (18 19 23 22)
  )
);
 
mergePatchPairs
(
);

// ************************************************************************* //
