tutorials/streetCanyonAirBrickRadiation/constant/brick/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
   version     2.0;
   format      ascii;
   class       dictionary;
   object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  (15 -10 0)
  (15.2 -10 0)
  (15.2 0 0)
  (15 0 0)
  (15 -10 0.01)
  (15.2 -10 0.01)
  (15.2 0 0.01)
  (15 0 0.01)
);
 
blocks
(
  hex (0 1 2 3 4 5 6 7) (4 200 1) simpleGrading (1 1 1)
);
 
edges
(
);
 
patches
(
  patch brick_to_air
  (
      (0 4 7 3)
  )
  patch interior
  (
      (1 5 6 2)
  )
  patch top
  (
      (3 2 6 7)
  )
  patch bottom
  (
      (0 1 5 4)
  )
  empty sides
  (
      (0 1 2 3)
      (4 5 6 7)
  )
);
 
mergePatchPairs
(
);

// ************************************************************************* //
