tutorials/streetCanyonAirBrickRadiation/constant/air/radiationProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      radiationProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

radiationModel  viewFactor;

fvDOMCoeffs
{
    nPhi    3;          // azimuthal angles in PI/2 on X-Y.(from Y to X)
    nTheta  0;          // polar angles in PI (from Z to X-Y plane)
    convergence 1e-3;   // convergence criteria for radiation iteration
    maxIter 10;         // maximum number of iterations
}

viewFactorCoeffs
{
    smoothing true; //Smooth view factor matrix (use when in a close surface
                //to force Sum(Fij = 1)
    constantEmissivity true; //constant emissivity on surfaces.
}

// Number of flow iterations per radiation iteration
solverFreq 10;

absorptionEmissionModel constantAbsorptionEmission;

constantAbsorptionEmissionCoeffs
{
	absorptivity absorptivity [ 0 -1 0 0 0 0 0 ] 0;
	emissivity emissivity [ 0 -1 0 0 0 0 0 ] 0;
	E E [ 1 -1 -3 0 0 0 0 ] 0;
}

scatterModel constantScatter;

constantScatterCoeffs
{ 
sigma sigma [ 0 -1 0 0 0 0 0 ] 0.1;
C C [ 0 0 0 0 0 0 0 ] 0;
}

// ************************************************************************* //
