tutorials/streetCanyonAirBrickRadiation/constant/air/viewFactorsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      viewFactorsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Write agglomeration as a volScalarField with calculated boundary values
writeFacesAgglomeration   true;

//Debug option
debug                     0;

//Dump connectivity rays
dumpRays                  false;

// Per patch (wildcard possible) the coarsening level
inlet
{
    nFacesInCoarsestLevel     30;
    featureAngle              10;
}
outlet
{
    nFacesInCoarsestLevel     30;
    featureAngle              10;
}
air_to_brick
{
    nFacesInCoarsestLevel     30;
    featureAngle              10;
}
ground
{
    nFacesInCoarsestLevel     30;
    featureAngle              10;
}
walls
{
    nFacesInCoarsestLevel     30;
    featureAngle              10;
}
top
{
    nFacesInCoarsestLevel     30;
    featureAngle              10;
}
sides
{
    nFacesInCoarsestLevel     30;
    featureAngle              10;
}


// ************************************************************************* //
