tutorials/streetCanyonAirBrickRadiation/0/air/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 100000;

boundaryField
{
    top
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            calculated;
        value           uniform 100000;
    }

    outlet
    {
        type            calculated;
        value           uniform 100000;
    }
    air_to_brick      
    {
        type            calculated;
        value           uniform 100000;
    }
    ground      
    {
        type            calculated;
        value           uniform 100000;
    }
    walls      
    {
        type            calculated;
        value           uniform 100000;
    }
    sides
    {
        type            empty;
    }
}

// ************************************************************************* //
