tutorials/streetCanyonAirBrickRadiation/0/air/Qr
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      Qr;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 0 -3 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            symmetryPlane;
    }
    sides
    {
        type            empty;
    }	
	 ".*"
	{
		type			zeroGradient;
		/*type 			greyDiffusiveRadiationViewFactor;
		emissivityMode 	lookup;
		Qro 			uniform 0;
		emissivity 		uniform 0;
		value 			uniform 0;*/
	}
    air_to_brick      
    {
        type            greyDiffusiveRadiationViewFactor;
		emissivityMode 	solidRadiation;
		Qro 			uniform 0;
		value 			uniform 0;
    }	

}

// ************************************************************************* //
