tutorials/streetCanyonAirBrickRadiation/0/air/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    top
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }

    outlet
    {
        type            calculated;
        value           uniform 0;
    }
    air_to_brick      
    {
        type            alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }	
    ground      
    {
        type            alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }
    walls      
    {
        type            alphatWallFunction;
        Prt             0.85;
        value           uniform 0;
    }	
    sides
    {
        type            empty;
    }
}


// ************************************************************************* //
