tutorials/streetCanyonAirBrickRadiation/system/air/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

/*porosityZone
{
    type          explicitPorositySource;
    active        yes;
    active        yes;
    selectionMode cellZone;
    cellZone      porosityZone;

    explicitPorositySourceCoeffs
    {
        type DarcyForchheimer;

        DarcyForchheimerCoeffs
        {
              d    d [0 -2 0 0 0 0 0] (5e7 -1 -1);
              f    f [0 -1 0 0 0 0 0] (5e7 -1 -1);

              coordinateSystem
              {
                  e1    (1 0 0);
                  e2    (0 1 0);
              }
        }
    }
}*/


// ************************************************************************* //
